---
kind: type
id: T:Autodesk.Revit.DB.Mechanical.DuctFlowConfigurationType
source: html/f9d97242-5293-595c-516c-f9e8034b5a07.htm
---
# Autodesk.Revit.DB.Mechanical.DuctFlowConfigurationType

An enumerated type listing all duct flow configuration types for a connector.

## Syntax (C#)
```csharp
public enum DuctFlowConfigurationType
```